Can't make Parts out of these Elements.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId RemovingInvalidDPartParents { get; }
  Visual Basic
Public Shared ReadOnly Property RemovingInvalidDPartParents As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ RemovingInvalidDPartParents {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DPartFailures Class
  Autodesk.Revit.DB Namespace